HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_regdef.h
/** \\brief  Downstream Data Register */
typedef struct _Ifx_MSC_DD_Bits
{
    unsigned int DDL:16;                    /**< \brief [15:0] Downstream Data for SRL Shift Register (rw) */
    unsigned int DDH:16;                    /**< \brief [31:16] Downstream Data for SRH Shift Register (rw) */
} Ifx_MSC_DD_Bits;

/** \\brief  Downstream Control Register */
typedef struct _Ifx_MSC_DSC_Bits
{
    unsigned int TM:1;                      /**< \brief [0:0] Transmission Mode (rw) */
    unsigned int CP:1;                      /**< \brief [1:1] Command Pending (rh) */
    unsigned int DP:1;                      /**< \brief [2:2] Data Pending (rh) */
    unsigned int NDBL:5;                    /**< \brief [7:3] Number of SRL Bits Shifted at Data Frames (rw) */
    unsigned int NDBH:5;                    /**< \brief [12:8] Number of SRH Bits Shifted at Data Frames (rw) */
    unsigned int ENSELL:1;                  /**< \brief [13:13] Enable SRL Active Phase Selection Bit (rw) */
    unsigned int ENSELH:1;                  /**< \brief [14:14] Enable SRH Active Phase Selection Bit (rw) */
    unsigned int DSDIS:1;                   /**< \brief [15:15] Downstream Disable (rh) */
    unsigned int NBC:6;                     /**< \brief [21:16] Number of Bits Shifted at Command Frames (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int PPD:5;                     /**< \brief [28:24] Passive Phase Length at Data Frames (rw) */
    unsigned int reserved_29:3;             /**< \brief \internal Reserved */
} Ifx_MSC_DSC_Bits;

/** \\brief  Downstream Control Enhanced Register 1 */
typedef struct _Ifx_MSC_DSCE_Bits
{
    unsigned int NDBHE:1;                   /**< \brief [0:0] Number of SRH Bits Shifted at Data Frames Extension (rw) */
    unsigned int NDBLE:1;                   /**< \brief [1:1] Number of SRH Bits Shifted at Data Frames Extension (rw) */
    unsigned int reserved_2:12;             /**< \brief \internal Reserved */
    unsigned int EXEN:1;                    /**< \brief [14:14] Extension Enable (rw) */
    unsigned int CCF:1;                     /**< \brief [15:15] Command-Comand Flag (rh) */
    unsigned int INJENP0:1;                 /**< \brief [16:16] Injection Enable of the Pin 0 Signal (rw) */
    unsigned int INJPOSP0:6;                /**< \brief [22:17] Injection Position of the Pin 0 Signal (rw) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int INJENP1:1;                 /**< \brief [24:24] Injection Enable of the Pin 1 Signal (rw) */
    unsigned int INJPOSP1:6;                /**< \brief [30:25] Injection Position of the Pin 1 Signal (rw) */
    unsigned int CDCM:1;                    /**< \brief [31:31] Command-Data-Comand in Data Repetition Mode (rw) */
} Ifx_MSC_DSCE_Bits;

/** \\brief  Downstream Select Data Source High Register */
typedef struct _Ifx_MSC_DSDSH_Bits
{
    unsigned int SH0:2;                     /**< \brief [1:0] Select Source for SRH (rw) */
    unsigned int SH1:2;                     /**< \brief [3:2] Select Source for SRH (rw) */
    unsigned int SH2:2;                     /**< \brief [5:4] Select Source for SRH (rw) */
    unsigned int SH3:2;                     /**< \brief [7:6] Select Source for SRH (rw) */
    unsigned int SH4:2;                     /**< \brief [9:8] Select Source for SRH (rw) */
    unsigned int SH5:2;                     /**< \brief [11:10] Select Source for SRH (rw) */
    unsigned int SH6:2;                     /**< \brief [13:12] Select Source for SRH (rw) */
    unsigned int SH7:2;                     /**< \brief [15:14] Select Source for SRH (rw) */
    unsigned int SH8:2;                     /**< \brief [17:16] Select Source for SRH (rw) */
    unsigned int SH9:2;                     /**< \brief [19:18] Select Source for SRH (rw) */
    unsigned int SH10:2;                    /**< \brief [21:20] Select Source for SRH (rw) */
    unsigned int SH11:2;                    /**< \brief [23:22] Select Source for SRH (rw) */
    unsigned int SH12:2;                    /**< \brief [25:24] Select Source for SRH (rw) */
    unsigned int SH13:2;                    /**< \brief [27:26] Select Source for SRH (rw) */
    unsigned int SH14:2;                    /**< \brief [29:28] Select Source for SRH (rw) */
    unsigned int SH15:2;                    /**< \brief [31:30] Select Source for SRH (rw) */
} Ifx_MSC_DSDSH_Bits;

/** \\brief  Downstream Select Data Source Low Register */
typedef struct _Ifx_MSC_DSDSL_Bits
{
    unsigned int SL0:2;                     /**< \brief [1:0] Select Source for SRL (rw) */
    unsigned int SL1:2;                     /**< \brief [3:2] Select Source for SRL (rw) */
    unsigned int SL2:2;                     /**< \brief [5:4] Select Source for SRL (rw) */
    unsigned int SL3:2;                     /**< \brief [7:6] Select Source for SRL (rw) */
    unsigned int SL4:2;                     /**< \brief [9:8] Select Source for SRL (rw) */
    unsigned int SL5:2;                     /**< \brief [11:10] Select Source for SRL (rw) */
    unsigned int SL6:2;                     /**< \brief [13:12] Select Source for SRL (rw) */
    unsigned int SL7:2;                     /**< \brief [15:14] Select Source for SRL (rw) */
    unsigned int SL8:2;                     /**< \brief [17:16] Select Source for SRL (rw) */
    unsigned int SL9:2;                     /**< \brief [19:18] Select Source for SRL (rw) */
    unsigned int SL10:2;                    /**< \brief [21:20] Select Source for SRL (rw) */
    unsigned int SL11:2;                    /**< \brief [23:22] Select Source for SRL (rw) */
    unsigned int SL12:2;                    /**< \brief [25:24] Select Source for SRL (rw) */
    unsigned int SL13:2;                    /**< \brief [27:26] Select Source for SRL (rw) */
    unsigned int SL14:2;                    /**< \brief [29:28] Select Source for SRL (rw) */
    unsigned int SL15:2;                    /**< \brief [31:30] Select Source for SRL (rw) */
} Ifx_MSC_DSDSL_Bits;

/** \\brief  Downstream Status Register */
typedef struct _Ifx_MSC_DSS_Bits
{
    unsigned int PFC:4;                     /**< \brief [3:0] Passive Time Frame Counter (rh) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int NPTF:4;                    /**< \brief [11:8] Number Of Passive Time Frames (rw) */
    unsigned int reserved_12:4;             /**< \brief \internal Reserved */
    unsigned int DC:8;                      /**< \brief [23:16] Downstream Counter (rh) */
    unsigned int DFA:1;                     /**< \brief [24:24] Data Frame Active (rh) */
    unsigned int CFA:1;                     /**< \brief [25:25] Command Frame Active (rh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_MSC_DSS_Bits;

