HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_regdef.h
/** \\brief  Emergency Stop Register */
typedef struct _Ifx_MSC_ESR_Bits
{
    unsigned int ENL0:1;                    /**< \brief [0:0] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL1:1;                    /**< \brief [1:1] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL2:1;                    /**< \brief [2:2] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL3:1;                    /**< \brief [3:3] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL4:1;                    /**< \brief [4:4] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL5:1;                    /**< \brief [5:5] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL6:1;                    /**< \brief [6:6] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL7:1;                    /**< \brief [7:7] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL8:1;                    /**< \brief [8:8] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL9:1;                    /**< \brief [9:9] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL10:1;                   /**< \brief [10:10] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL11:1;                   /**< \brief [11:11] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL12:1;                   /**< \brief [12:12] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL13:1;                   /**< \brief [13:13] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL14:1;                   /**< \brief [14:14] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENL15:1;                   /**< \brief [15:15] Emergency Stop Enable for Bit x in SRL (rw) */
    unsigned int ENH0:1;                    /**< \brief [16:16] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH1:1;                    /**< \brief [17:17] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH2:1;                    /**< \brief [18:18] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH3:1;                    /**< \brief [19:19] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH4:1;                    /**< \brief [20:20] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH5:1;                    /**< \brief [21:21] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH6:1;                    /**< \brief [22:22] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH7:1;                    /**< \brief [23:23] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH8:1;                    /**< \brief [24:24] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH9:1;                    /**< \brief [25:25] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH10:1;                   /**< \brief [26:26] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH11:1;                   /**< \brief [27:27] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH12:1;                   /**< \brief [28:28] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH13:1;                   /**< \brief [29:29] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH14:1;                   /**< \brief [30:30] Emergency Stop Enable for Bit x in SRH (rw) */
    unsigned int ENH15:1;                   /**< \brief [31:31] Emergency Stop Enable for Bit x in SRH (rw) */
} Ifx_MSC_ESR_Bits;

/** \\brief  Fractional Divider Register */
typedef struct _Ifx_MSC_FDR_Bits
{
    unsigned int STEP:10;                   /**< \brief [9:0] Step Value (rw) */
    unsigned int reserved_10:1;             /**< \brief \internal Reserved */
    unsigned int SM:1;                      /**< \brief [11:11] Suspend Mode (rw) */
    unsigned int SC:2;                      /**< \brief [13:12] Suspend Control (rw) */
    unsigned int DM:2;                      /**< \brief [15:14] Divider Mode (rw) */
    unsigned int RESULT:10;                 /**< \brief [25:16] Result Value (rh) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int SUSACK:1;                  /**< \brief [28:28] Suspend Mode Acknowledge (rh) */
    unsigned int SUSREQ:1;                  /**< \brief [29:29] Suspend Mode Request (rh) */
    unsigned int ENHW:1;                    /**< \brief [30:30] Enable Hardware Clock Control (rw) */
    unsigned int DISCLK:1;                  /**< \brief [31:31] Disable Clock (rwh) */
} Ifx_MSC_FDR_Bits;

/** \\brief  Interrupt Control Register */
typedef struct _Ifx_MSC_ICR_Bits
{
    unsigned int EDIP:2;                    /**< \brief [1:0] Data Frame Interrupt Node Pointer (rw) */
    unsigned int EDIE:2;                    /**< \brief [3:2] Data Frame Interrupt Enable (rw) */
    unsigned int ECIP:2;                    /**< \brief [5:4] Command Frame Interrupt Node Pointer (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int ECIE:1;                    /**< \brief [7:7] Command Frame Interrupt Enable (rw) */
    unsigned int TFIP:2;                    /**< \brief [9:8] Time Frame Interrupt Pointer (rw) */
    unsigned int reserved_10:1;             /**< \brief \internal Reserved */
    unsigned int TFIE:1;                    /**< \brief [11:11] Time Frame Interrupt Enable (rw) */
    unsigned int RDIP:2;                    /**< \brief [13:12] Receive Data Interrupt Pointer (rw) */
    unsigned int RDIE:2;                    /**< \brief [15:14] Receive Data Interrupt Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_MSC_ICR_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_MSC_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_MSC_ID_Bits;

