HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxMsc_regdef.h
/** \\brief  Interrupt Set Clear Register */
typedef struct _Ifx_MSC_ISC_Bits
{
    unsigned int CDEDI:1;                   /**< \brief [0:0] Clear DEDI Flag (w) */
    unsigned int CDECI:1;                   /**< \brief [1:1] Clear DECI Flag (w) */
    unsigned int CDTFI:1;                   /**< \brief [2:2] Clear DTFI Flag (w) */
    unsigned int CURDI:1;                   /**< \brief [3:3] Clear URDI Flag (w) */
    unsigned int CDP:1;                     /**< \brief [4:4] Clear DP Flag (w) */
    unsigned int CCP:1;                     /**< \brief [5:5] Clear CP Flag (w) */
    unsigned int CDDIS:1;                   /**< \brief [6:6] Clear DSDIS Flag (w) */
    unsigned int reserved_7:9;              /**< \brief \internal Reserved */
    unsigned int SDEDI:1;                   /**< \brief [16:16] Set DEDI Flag (w) */
    unsigned int SDECI:1;                   /**< \brief [17:17] Set DECI Flag (w) */
    unsigned int SDTFI:1;                   /**< \brief [18:18] Set DTFI Flag (w) */
    unsigned int SURDI:1;                   /**< \brief [19:19] Set URDI Flag (w) */
    unsigned int SDP:1;                     /**< \brief [20:20] Set DP Bit (w) */
    unsigned int SCP:1;                     /**< \brief [21:21] Set CP Flag (w) */
    unsigned int SDDIS:1;                   /**< \brief [22:22] Set DSDIS Flag (w) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_MSC_ISC_Bits;

/** \\brief  Interrupt Status Register */
typedef struct _Ifx_MSC_ISR_Bits
{
    unsigned int DEDI:1;                    /**< \brief [0:0] Data Frame Interrupt Flag (rh) */
    unsigned int DECI:1;                    /**< \brief [1:1] Command Frame Interrupt Flag (rh) */
    unsigned int DTFI:1;                    /**< \brief [2:2] Time Frame Interrupt Flag (rh) */
    unsigned int URDI:1;                    /**< \brief [3:3] Receive Data Interrupt Flag (rh) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_MSC_ISR_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_MSC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_MSC_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_MSC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_MSC_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_MSC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_MSC_KRSTCLR_Bits;

/** \\brief  Output Control Register */
typedef struct _Ifx_MSC_OCR_Bits
{
    unsigned int CLP:1;                     /**< \brief [0:0] FCLP Line Polarity (rw) */
    unsigned int SLP:1;                     /**< \brief [1:1] SOP Line Polarity (rw) */
    unsigned int CSLP:1;                    /**< \brief [2:2] Chip Selection Lines Polarity (rw) */
    unsigned int ILP:1;                     /**< \brief [3:3] SDI Line Polarity (rw) */
    unsigned int reserved_4:4;              /**< \brief \internal Reserved */
    unsigned int CLKCTRL:1;                 /**< \brief [8:8] Clock Control (rw) */
    unsigned int CSL:2;                     /**< \brief [10:9] Chip Enable Selection for ENL (rw) */
    unsigned int CSH:2;                     /**< \brief [12:11] Chip Enable Selection for ENH (rw) */
    unsigned int CSC:2;                     /**< \brief [14:13] Chip Enable Selection for ENC (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int SDISEL:3;                  /**< \brief [18:16] Serial Data Input Selection (rw) */
    unsigned int reserved_19:13;            /**< \brief \internal Reserved */
} Ifx_MSC_OCR_Bits;

/** \\brief  OCDS Control and Status */
typedef struct _Ifx_MSC_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_MSC_OCS_Bits;

/** \\brief  Upstream Data Register */
typedef struct _Ifx_MSC_UD_Bits
{
    unsigned int DATA:8;                    /**< \brief [7:0] Received Data (rh) */
    unsigned int reserved_8:8;              /**< \brief \internal Reserved */
    unsigned int V:1;                       /**< \brief [16:16] Valid Bit (rh) */
    unsigned int P:1;                       /**< \brief [17:17] Parity Bit (rh) */
    unsigned int C:1;                       /**< \brief [18:18] Clear Bit (w) */
    unsigned int LABF:2;                    /**< \brief [20:19] Lower Address Bit Field (rh) */
    unsigned int IPF:1;                     /**< \brief [21:21] Internal Parity Flag (rh) */
    unsigned int PERR:1;                    /**< \brief [22:22] Parity Error (rh) */
    unsigned int reserved_23:9;             /**< \brief \internal Reserved */
} Ifx_MSC_UD_Bits;

/** \\brief  Upstream Control Enhanced Register 1 */
typedef struct _Ifx_MSC_USCE_Bits
{
    unsigned int USTOPRE:4;                 /**< \brief [3:0] Upstream Timeout Prescaler (rw) */
    unsigned int USTOVAL:4;                 /**< \brief [7:4] Upstream Timeout Value (rw) */
    unsigned int USTOEN:1;                  /**< \brief [8:8] Upstream Timeout Interrupt Enable (rw) */
    unsigned int USTF:1;                    /**< \brief [9:9] Upstream Timeout Flag (rh) */
    unsigned int USTC:1;                    /**< \brief [10:10] Upstream Timout Clear (w) */
    unsigned int USTS:1;                    /**< \brief [11:11] Upstream Timout Set (w) */
    unsigned int reserved_12:1;             /**< \brief \internal Reserved */
    unsigned int UTASR:1;                   /**< \brief [13:13] Upstream Timout Alternate Service Request (rw) */
    unsigned int USTOIP:2;                  /**< \brief [15:14] Upstream Timout Interrupt Node Pointer (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_MSC_USCE_Bits;

/** \\brief  Upstream Status Register */
typedef struct _Ifx_MSC_USR_Bits
{
    unsigned int UFT:1;                     /**< \brief [0:0] Upstream Channel Frame Type (rw) */
    unsigned int URR:3;                     /**< \brief [3:1] Upstream Channel Receiving Rate (rw) */
    unsigned int PCTR:1;                    /**< \brief [4:4] Parity Control (rw) */
    unsigned int SRDC:1;                    /**< \brief [5:5] Service Request Delay Control (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int UC:5;                      /**< \brief [20:16] Upstream Counter (rh) */
    unsigned int reserved_21:11;            /**< \brief \internal Reserved */
} Ifx_MSC_USR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Msc_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ACCEN0_Bits B;
} Ifx_MSC_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_ACCEN1_Bits B;
} Ifx_MSC_ACCEN1;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_CLC_Bits B;
} Ifx_MSC_CLC;

/** \\brief  Downstream Command Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_MSC_DC_Bits B;
} Ifx_MSC_DC;

